app/controllers/cpus_controller.rb

SELECT "cpus".* FROM "cpus"
---
  def index
    @cpus = Cpu.all

SELECT  "cpus".* FROM "cpus" WHERE "cpus"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_cpu
      @cpu = Cpu.find(params[:id])