app/controllers/hdds_controller.rb

SELECT "hdds".* FROM "hdds"
---
  def index
    @hdds = Hdd.all

SELECT  "hdds".* FROM "hdds" WHERE "hdds"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_hdd
      @hdd = Hdd.find(params[:id])