app/controllers/motherboards_controller.rb

  def index
    @motherboards = Motherboard.all
---
SELECT "motherboards".* FROM "motherboards"

    def set_motherboard
      @motherboard = Motherboard.find(params[:id])
---
SELECT  "motherboards".* FROM "motherboards" WHERE "motherboards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]