app/controllers/power_supplies_controller.rb

  def index
    @power_supplies = PowerSupply.all
---
SELECT "power_supplies".* FROM "power_supplies"

    def set_power_supply
      @power_supply = PowerSupply.find(params[:id])
---
SELECT  "power_supplies".* FROM "power_supplies" WHERE "power_supplies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]