app/controllers/rams_controller.rb

  def index
    @rams = Ram.all
---
SELECT "rams".* FROM "rams"

    def set_ram
      @ram = Ram.find(params[:id])
---
SELECT  "rams".* FROM "rams" WHERE "rams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]