app/controllers/ssds_controller.rb

  def index
    @ssds = Ssd.all
---
SELECT "ssds".* FROM "ssds"

    def set_ssd
      @ssd = Ssd.find(params[:id])
---
SELECT  "ssds".* FROM "ssds" WHERE "ssds"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]