app/controllers/video_cards_controller.rb

  def index
    @video_cards = VideoCard.all
---
SELECT "video_cards".* FROM "video_cards"

  def destroy
    @video_card.destroy
---
DELETE FROM "video_cards" WHERE "video_cards"."id" = $1  [["id", 1]]

    def set_video_card
      @video_card = VideoCard.find(params[:id])
---
SELECT  "video_cards".* FROM "video_cards" WHERE "video_cards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]