app/views/motherboards/_nested_chipset_form.html.haml

SELECT "cpu_sockets".* FROM "cpu_sockets"
---
    = ff.text_field :name
    = ff.collection_select(:cpu_socket_id, CpuSocket.all, :id, :name)